Catalogs/МедицинскиеКарты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>МедицинскиеКарты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКарты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКарты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыМедицинскихКарт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписанЭП</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЗаполняемыеПараметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПараметра</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ПараметрыМедицинскойКарты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ПараметрыМедицинскойКарты</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяВручнуюЗаполненногоПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/РаботаСДокументамиСерверПереопределяемый/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Переопределяемая функция получения цены номенклатуры в контексте документа.
//
// Параметры:
//  СтандартнаяОбработка		 - Булево									 - при установке в Ложь стандартная операция выполняться не будет.
//  ДанныеШапкиОбъекта			 - Структура, ДокументОбъект				 - данные шапки документа для получения пола по полю Клиент.
//  Прейскурант					 - СправочникСсылка.Прейскуранты			 - прейскурант.
//  Номенклатура				 - СправочникСсылка.Номенклатура			 - номенклатура.
//  НаМомент					 - Дата, МоментВремени						 - дата цен.
//  ХарактеристикаНоменклатуры	 - СправочникСсылка.ХарактеристикаНоменклатуры	 - характеристика.
//  ЕдиницаИзмерения			 - СправочникСсылка.ЕдиницаИзмерения			 - единица измерения.
// 
// Возвращаемое значение:
//   Число.
//
Функция ПолучитьЦену(СтандартнаяОбработка, ДанныеШапкиОбъекта, Прейскурант, Номенклатура, НаМомент, ХарактеристикаНоменклатуры, ЕдиницаИзмерения) Экспорт
	
	// Добавлено Изменено Макеев (
	СтандартнаяОбработка = Ложь;
	ДопСтруктураШапки = Новый Структура("Филиал, омг_Набор,омг_НаборУровень", Неопределено, Неопределено, Неопределено);
	ЗаполнитьЗначенияСвойств(ДопСтруктураШапки, ДанныеШапкиОбъекта);
	
	Возврат Ценообразование.ПолучитьЦену(Прейскурант, Номенклатура, НаМомент, ХарактеристикаНоменклатуры, ЕдиницаИзмерения,, ДопСтруктураШапки.Филиал, ДопСтруктураШапки.омг_Набор,ДопСтруктураШапки.омг_НаборУровень).Цена;
	// )
КонецФункции

// Создает дополнительные команды операций журнала записи для создания документов.
//
// Параметры:
//  МассивОписанийКоманд - Массив	 - описание команд.
//
Процедура ДополнительныеКомандыОперацийЖурналаЗаписи(МассивОписанийКоманд = Неопределено) Экспорт
	
	Если ТипЗнч(МассивОписанийКоманд) <> Тип("Массив") Тогда
		МассивОписанийКоманд = Новый Массив;
	КонецЕсли;
	
	// Создание продаж из прочих источников.
	МетаданныеФормы = Метаданные.ОбщиеФормы.Найти("ВыборУслугДляСозданияДокумента");
	Если МетаданныеФормы <> Неопределено
		И ПравоДоступа("Просмотр", МетаданныеФормы)
	Тогда
		НужнаКомандаПродажПоПриемам = УправлениеНастройкамиПереопределяемый.ПолучитьПараметрУчета("ПостоплатаПоПриемамИспользуется") = Истина;
		
		НужнаКомандаПродажПоАнализам = УправлениеНастройкамиПереопределяемый.ПолучитьПараметрУчета("ИспользоватьЛабораторныеИсследования") = Истина
									 И УправлениеНастройкамиПереопределяемый.ПолучитьПараметрУчета("ЛабораторияПоПостоплатеПрименяется") = Истина;
			
		НужнаКомандаПродажПоВакцинациям = УправлениеНастройкамиПереопределяемый.ПолучитьПараметрУчета("ИспользоватьВакцинации") = Истина;
		
		Заголовок = Неопределено;
		Подсказка = Неопределено;
		
		Если НужнаКомандаПродажПоПриемам Тогда
			Заголовок = НСтр("ru='Продажа выполенных услуг'");
			Подсказка = НСтр("ru='Оформить продажу выполненных услуг'");
			
			Если НужнаКомандаПродажПоАнализам Тогда
				Заголовок = Заголовок + НСтр("ru=', забранных анализов'");
				Подсказка = Подсказка + НСтр("ru=', забранных анализов'");
			КонецЕсли;
			Если НужнаКомандаПродажПоВакцинациям Тогда
				Заголовок = Заголовок + НСтр("ru=', выполненных вакцинаций'");
				Подсказка = Подсказка + НСтр("ru=', выполненных вакцинаций'");
			КонецЕсли;
		Иначе
			Если НужнаКомандаПродажПоАнализам И НЕ НужнаКомандаПродажПоВакцинациям Тогда
				Заголовок = НСтр("ru='Продажа забранных анализов'");
				Подсказка = НСтр("ru='Оформить продажу забранных анализов'");
			ИначеЕсли Не НужнаКомандаПродажПоАнализам И НужнаКомандаПродажПоВакцинациям Тогда
				Заголовок = НСтр("ru='Продажа выполненных вакцинаций'");
				Подсказка = НСтр("ru='Оформить продажу выполненных вакцинаций'");
			ИначеЕсли НужнаКомандаПродажПоАнализам И НужнаКомандаПродажПоВакцинациям Тогда
				Заголовок = НСтр("ru='Продажа забранных анализов, выполненных вакцинаций'");
				Подсказка = НСтр("ru='Оформить продажу забранных анализов, выполненных вакцинаций'");
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Заголовок) Тогда
			
			МассивОписанийКоманд.Добавить(РаботаСФормамиСервер.ОписаниеУниверсальнойПодключаемойКомандыФормы(
											"РаботаСКлиентамиКлиентПереопределяемый.СоздатьПродажуПоНачатомуПосещению",
											Заголовок,
											Подсказка,
											ОбщегоНазначенияКлиентСервер.СвойствоОбъекта(БиблиотекаКартинок, "ЛабораторныеКонтейнерыСхематично"),
											,, Новый СочетаниеКлавиш(Клавиша.S, Истина)
											));
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Обработчик заполнения нового документа по основанию.
//
// Параметры:
//  СтандартнаяОбработка - Булево - Признак, требуется ли далее выполнение стандартной обработки.
//  ЭтотОбъект			 - ДокументОбъект	 - Новый документ, заполняемый по основанию.
//  Основание			 - Произвольный	 - Параметр-основание для ввода документа.
//  Копирование			 - Булево - Признак ввода документа копированием.
//
Процедура ОбработчикЗаполнения(СтандартнаяОбработка, ЭтотОбъект, Основание, Копирование) Экспорт
	
	#Область КОРП
	Если ТипЗнч(Основание) =  Тип("ДокументСсылка.ЗаказНаИсследованиеВнутренний") Тогда 
		Если ТипЗнч(ЭтотОбъект)=Тип("ДокументОбъект.Прием") Тогда
			дкОбработкаЗаполнения_ЗаказНаИсследованиеВнутренний_Прием(ЭтотОбъект,Основание,Копирование);
			СтандартнаяОбработка = Ложь;
		КонецЕсли;
	ИначеЕсли ТипЗнч(Основание) =  Тип("ДокументСсылка.ДействияЗаСутки") Тогда 
		Если ТипЗнч(ЭтотОбъект)=Тип("ДокументОбъект.СписаниеТоваров") Тогда
			дкОбработкаЗаполнения_ДействияЗаСутки_СписаниеТоваров(ЭтотОбъект,Основание,Копирование);
			СтандартнаяОбработка = Ложь;
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Основание) =  Тип("Структура") Тогда 
		Если ТипЗнч(ЭтотОбъект)=Тип("ДокументОбъект.Прием") Тогда
			Если Основание.Свойство("Основание")
				И ТипЗнч(Основание.Основание) = Тип("ДокументСсылка.ОбращениеВСтационар")
			Тогда
				Стационар.ОбработкаЗаполнения_ОбращениеВСтационарСтруктура_Прием(ЭтотОбъект, Основание.Основание);
				СтандартнаяОбработка = Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	#КонецОбласти
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область КОРП
Функция дкОбработкаЗаполнения_ДействияЗаСутки_СписаниеТоваров(ЭтотОбъект,Основание,Копирование)
	
	ЭтотОбъект.Склад = Основание.Склад;
	Для Каждого СтрокаОснования Из Основание.ДействияСтационара Цикл
		
		Если ТипЗнч(СтрокаОснования.ДействиеСтационара) = Тип("СправочникСсылка.Номенклатура")
			И РаботаСФормамиСервер.ЭтоМатериал(СтрокаОснования.ДействиеСтационара)
		Тогда
			НоваяСтрока = ЭтотОбъект.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаОснования);
			НоваяСтрока.Номенклатура = СтрокаОснования.ДействиеСтационара;
			Если Не ЗначениеЗаполнено(НоваяСтрока.Коэффициент) Тогда
				НоваяСтрока.Коэффициент = НоваяСтрока.ЕдиницаИзмерения.Коэффициент;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого СтрокаОснования Из Основание.Перерасход Цикл
		НоваяСтрока = ЭтотОбъект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаОснования);
		Если Не ЗначениеЗаполнено(НоваяСтрока.Коэффициент) Тогда
			НоваяСтрока.Коэффициент = НоваяСтрока.ЕдиницаИзмерения.Коэффициент;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция дкОбработкаЗаполнения_ЗаказНаИсследованиеВнутренний_Прием(ЭтотОбъект,Основание,Копирование)
	
	// Заполнение шапки
	ЗаполнитьЗначенияСвойств(ЭтотОбъект,Основание,,"Дата, Номер, ПометкаУдаления, Проведен, Ссылка");
	
	ЭтотОбъект.Основание = Основание;
	
	// Поиск наиболее основной медкарты
	Если ЗначениеЗаполнено(Основание.Клиент.ОсновнаяМедицинскаяКарта) Тогда
		МедКартаПрием = Основание.Клиент.ОсновнаяМедицинскаяКарта;
	Иначе
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Клиент", Основание.Клиент);
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 2
		|	МедицинскиеКарты.Ссылка
		|ИЗ
		|	Справочник.МедицинскиеКарты КАК МедицинскиеКарты
		|ГДЕ
		|	МедицинскиеКарты.Клиент = &Клиент";
		Выб = Запрос.Выполнить().Выбрать();
		Если Выб.Количество() = 1 Тогда
			Выб.Следующий();
			МедКартаПрием = Выб.Ссылка;
		КонецЕсли;
	КонецЕсли;
	ЭтотОбъект.МедицинскаяКарта = МедКартаПрием;
	
	ЭтотОбъект.ДокументОснование = Основание;
	
	РезультатПолученный = Основание.Результат;
	ИсследованияПолученные = Основание.Исследования;
	
	Если ЗначениеЗаполнено(РезультатПолученный) Тогда
		ТекстОсмотра = РезультатПолученный.Получить();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекстОсмотра) Тогда 
		ЭтотОбъект.Осмотр = ТекстОсмотра;
	КонецЕсли;
	
	Для Каждого СтрокаИсследование Из ИсследованияПолученные Цикл
		//Если СтрокаИсследование.Состояние = Перечисления.СостоянияЗаказовЛаборатории.ПолученРезультат Тогда
			НоваяСтрока = ЭтотОбъект.Работы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаИсследование);
			НоваяСтрока.КлючСтроки = НоваяСтрока.НомерСтроки;
		//КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции
#КонецОбласти

#КонецОбласти
